In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv('/content/demo01.csv')
print(df.head())

  sexo posse_de_veiculo posse_de_imovel  qtd_filhos            tipo_renda  \
0    M                Y               Y           0               Working
1    F                N               Y           0  Commercial associate
2    F                N               Y           0  Commercial associate
3    M                Y               Y           0               Working
4    F                Y               N           0               Working

                        educacao          estado_civil    tipo_residencia  \
0  Secondary / secondary special               Married  House / apartment
1  Secondary / secondary special  Single / not married  House / apartment
2  Secondary / secondary special  Single / not married  House / apartment
3               Higher education               Married  House / apartment
4              Incomplete higher               Married  House / apartment

       idade  tempo_emprego  possui_celular  possui_fone_comercial  \
0  58.832877       3.106849               1                      0
1  52.356164       8.358904               1                      0
2  52.356164       8.358904               1                      0
3  46.224658       2.106849               1                      1
4  29.230137       3.021918               1                      0

   possui_fone  possui_email  qt_pessoas_residencia    mau
0            0             0                    2.0  False
1            1             1                    1.0  False
2            1             1                    1.0  False
3            1             1                    2.0  False
4            0             0                    2.0  False

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16650 entries, 0 to 16649
Data columns (total 16 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   sexo                   16650 non-null  object
 1   posse_de_veiculo       16650 non-null  object
 2   posse_de_imovel        16650 non-null  object
 3   qtd_filhos             16650 non-null  int64
 4   tipo_renda             16650 non-null  object
 5   educacao               16650 non-null  object
 6   estado_civil           16650 non-null  object
 7   tipo_residencia        16650 non-null  object
 8   idade                  16650 non-null  float64
 9   tempo_emprego          16650 non-null  float64
 10  possui_celular         16650 non-null  int64
 11  possui_fone_comercial  16650 non-null  int64
 12  possui_fone            16650 non-null  int64
 13  possui_email           16650 non-null  int64
 14  qt_pessoas_residencia  16650 non-null  float64
 15  mau                    16650 non-null  bool
dtypes: bool(1), float64(3), int64(5), object(7)
memory usage: 1.9+ MB

In [5]:
dtypes = df.dtypes
print(dtypes)

sexo                      object
posse_de_veiculo          object
posse_de_imovel           object
qtd_filhos                 int64
tipo_renda                object
educacao                  object
estado_civil              object
tipo_residencia           object
idade                    float64
tempo_emprego            float64
possui_celular             int64
possui_fone_comercial      int64
possui_fone                int64
possui_email               int64
qt_pessoas_residencia    float64
mau                         bool
dtype: object

In [6]:
df.isna().sum()

sexo                     0
posse_de_veiculo         0
posse_de_imovel          0
qtd_filhos               0
tipo_renda               0
educacao                 0
estado_civil             0
tipo_residencia          0
idade                    0
tempo_emprego            0
possui_celular           0
possui_fone_comercial    0
possui_fone              0
possui_email             0
qt_pessoas_residencia    0
mau                      0
dtype: int64

In [7]:
percentage = (df.isnull().sum() / len(df)) * 100
percentage

sexo                     0.0
posse_de_veiculo         0.0
posse_de_imovel          0.0
qtd_filhos               0.0
tipo_renda               0.0
educacao                 0.0
estado_civil             0.0
tipo_residencia          0.0
idade                    0.0
tempo_emprego            0.0
possui_celular           0.0
possui_fone_comercial    0.0
possui_fone              0.0
possui_email             0.0
qt_pessoas_residencia    0.0
mau                      0.0
dtype: float64

In [8]:
titanic_sem_na = df.dropna(axis=1)

In [9]:
data = {
    'Nome da Variável': [
        'ID', 'CODE_GENDER', 'FLAG_OWN_CAR', 'FLAG_OWN_REALTY', 'CNT_CHILDREN',
        'AMT_INCOME_TOTAL', 'NAME_INCOME_TYPE', 'NAME_EDUCATION_TYPE',
        'NAME_FAMILY_STATUS', 'NAME_HOUSING_TYPE', 'DAYS_BIRTH', 'DAYS_EMPLOYED',
        'FLAG_MOBIL', 'FLAG_WORK_PHONE', 'FLAG_PHONE', 'FLAG_EMAIL', 'OCCUPATION_TYPE',
        'CNT_FAM_MEMBERS'
    ],
    'Tipo de Dado': [
        'int64', 'object', 'object', 'object', 'int64',
        'float64', 'object', 'object', 'object', 'object',
        'int64', 'int64', 'int64', 'int64', 'int64',
        'int64', 'object', 'float64'
    ]
}

In [10]:
df_info = pd.DataFrame(data)

In [11]:
df = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'CODE_GENDER': ['F', 'M', 'F', 'M'],
    'FLAG_OWN_CAR': ['N', 'Y', 'N', 'Y'],
    'FLAG_OWN_REALTY': ['Y', 'Y', 'N', 'Y'],
    'CNT_CHILDREN': [0, 1, 2, 0],
    'AMT_INCOME_TOTAL': [50000, 60000, 70000, 80000],
    'NAME_INCOME_TYPE': ['Working', 'Working', 'Working', 'Pensioner'],
    'NAME_EDUCATION_TYPE': ['Secondary', 'Higher', 'Higher', 'Secondary'],
    'NAME_FAMILY_STATUS': ['Single', 'Married', 'Single', 'Married'],
    'NAME_HOUSING_TYPE': ['House', 'Apartment', 'House', 'Apartment'],
    'DAYS_BIRTH': [-10000, -12000, -15000, -18000],
    'DAYS_EMPLOYED': [-2000, -3000, -4000, -5000],
    'FLAG_MOBIL': [1, 1, 1, 1],
    'FLAG_WORK_PHONE': [1, 1, 0, 0],
    'FLAG_PHONE': [1, 1, 1, 1],
    'FLAG_EMAIL': [1, 0, 1, 1],
    'OCCUPATION_TYPE': ['Laborers', 'Managers', 'Laborers', 'Sales'],
    'CNT_FAM_MEMBERS': [1, 2, 3, 2]
})

In [12]:
def calcular_qtd_categorias(nome_variavel):
    tipo_dado = df_info.loc[df_info['Nome da Variável'] == nome_variavel, 'Tipo de Dado'].values[0]
    if tipo_dado == 'object':
        return df[nome_variavel].nunique()
    return 0

df_info['qtd_categorias'] = df_info['Nome da Variável'].apply(calcular_qtd_categorias)

print("DataFrame com Nomes, Tipos de Dados e Quantidade de Categorias:")
print(df_info)

DataFrame com Nomes, Tipos de Dados e Quantidade de Categorias:
       Nome da Variável Tipo de Dado  qtd_categorias
0                    ID        int64               0
1           CODE_GENDER       object               2
2          FLAG_OWN_CAR       object               2
3       FLAG_OWN_REALTY       object               2
4          CNT_CHILDREN        int64               0
5      AMT_INCOME_TOTAL      float64               0
6      NAME_INCOME_TYPE       object               2
7   NAME_EDUCATION_TYPE       object               2
8    NAME_FAMILY_STATUS       object               2
9     NAME_HOUSING_TYPE       object               2
10           DAYS_BIRTH        int64               0
11        DAYS_EMPLOYED        int64               0
12           FLAG_MOBIL        int64               0
13      FLAG_WORK_PHONE        int64               0
14           FLAG_PHONE        int64               0
15           FLAG_EMAIL        int64               0
16      OCCUPATION_TYPE       object               3
17      CNT_FAM_MEMBERS      float64               0

In [13]:
df_dummies = pd.get_dummies(df, columns=[
    'CODE_GENDER', 'FLAG_OWN_CAR', 'FLAG_OWN_REALTY',
    'NAME_INCOME_TYPE', 'NAME_EDUCATION_TYPE',
    'NAME_FAMILY_STATUS', 'NAME_HOUSING_TYPE', 'OCCUPATION_TYPE'
])

In [14]:
df_ml_ready = df_dummies.copy()

print("DataFrame preparado para entrada no Scikit-learn:")
print(df_ml_ready)

DataFrame preparado para entrada no Scikit-learn:
   ID  CNT_CHILDREN  AMT_INCOME_TOTAL  DAYS_BIRTH  DAYS_EMPLOYED  FLAG_MOBIL  \
0   1             0             50000      -10000          -2000           1
1   2             1             60000      -12000          -3000           1
2   3             2             70000      -15000          -4000           1
3   4             0             80000      -18000          -5000           1

   FLAG_WORK_PHONE  FLAG_PHONE  FLAG_EMAIL  CNT_FAM_MEMBERS  ...  \
0                1           1           1                1  ...
1                1           1           0                2  ...
2                0           1           1                3  ...
3                0           1           1                2  ...

   NAME_INCOME_TYPE_Working  NAME_EDUCATION_TYPE_Higher  \
0                      True                       False
1                      True                        True
2                      True                        True
3                     False                       False

   NAME_EDUCATION_TYPE_Secondary  NAME_FAMILY_STATUS_Married  \
0                           True                       False
1                          False                        True
2                          False                       False
3                           True                        True

   NAME_FAMILY_STATUS_Single  NAME_HOUSING_TYPE_Apartment  \
0                       True                        False
1                      False                         True
2                       True                        False
3                      False                         True

   NAME_HOUSING_TYPE_House  OCCUPATION_TYPE_Laborers  \
0                     True                      True
1                    False                     False
2                     True                      True
3                    False                     False

   OCCUPATION_TYPE_Managers  OCCUPATION_TYPE_Sales
0                     False                  False
1                      True                  False
2                     False                  False
3                     False                   True

[4 rows x 27 columns]

In [15]:
df = pd.DataFrame({
    'possui_email': [1, 0, 1, 0, 1, 0, 1, 0],
    'posse_de_veiculo': [1, 1, 0, 0, 1, 0, 0, 1],
    'mau': [0, 1, 0, 1, 0, 1, 1, 0]
})

In [16]:
tabela_cruzada_email = pd.crosstab(df['possui_email'], df['mau'], rownames=['possui_email'], colnames=['mau'])
tabela_cruzada_veiculo = pd.crosstab(df['posse_de_veiculo'], df['mau'], rownames=['posse_de_veiculo'], colnames=['mau'])

In [17]:
taxa_email = tabela_cruzada_email[1] / tabela_cruzada_email.sum(axis=1)
taxa_veiculo = tabela_cruzada_veiculo[1] / tabela_cruzada_veiculo.sum(axis=1)

print("Tabela Cruzada entre 'possui_email' e 'mau':")
print(tabela_cruzada_email)
print("\nTaxa de 'mau = 1' por 'possui_email':")
print(taxa_email)

print("\nTabela Cruzada entre 'posse_de_veiculo' e 'mau':")
print(tabela_cruzada_veiculo)
print("\nTaxa de 'mau = 1' por 'posse_de_veiculo':")
print(taxa_veiculo)

Tabela Cruzada entre 'possui_email' e 'mau':
mau           0  1
possui_email
0             1  3
1             3  1

Taxa de 'mau = 1' por 'possui_email':
possui_email
0    0.75
1    0.25
dtype: float64

Tabela Cruzada entre 'posse_de_veiculo' e 'mau':
mau               0  1
posse_de_veiculo
0                 1  3
1                 3  1

Taxa de 'mau = 1' por 'posse_de_veiculo':
posse_de_veiculo
0    0.75
1    0.25
dtype: float64